# Disconnect Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..Disconnect Method
AnalyticalModel Class See Also
---
Unjoin from Hub Element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void Disconnect(
	AnalyticalElementSelector selector
)
```

Visual Basic
---
```text
Public Sub Disconnect ( _
	selector As AnalyticalElementSelector _
)
```

Visual C++
---
```text
public:
void Disconnect(
	AnalyticalElementSelector selector
)
```

# ### Parameters
selector
    Type: Autodesk.Revit.DB.Structure..::..AnalyticalElementSelector End of the analytical model.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace